# Homebrew bundle for this dotfiles repo.
#
# Install everything with:
#   brew bundle --file=./Brewfile
#
# Notes:
# - This is a curated manifest for the tooling/configs present in this repo
# - Some parts of the setup are managed outside Homebrew:
#   - bun (usually installed via bun installer)
#   - Pi (via npm)
#   - SDKMAN! (Java ecosystem tools)
#   - Node versions installed via fnm
#   - local machine overrides in ~/.zshrc.local

# Fonts / GUI apps
cask "ghostty"
cask "font-fira-code-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-victor-mono-nerd-font"

# Shell / prompt / navigation
brew "zsh-autosuggestions"
brew "fzf"
brew "zoxide"
brew "starship"
brew "fnm"
brew "pyenv"

# Terminal / editor
brew "tmux"
brew "neovim"

# Core CLI tools
brew "ripgrep"
brew "fd"
brew "bat"
brew "lsd"
brew "jq"
brew "gh"
brew "terraform"
brew "go"

# Extra tools
brew "opencode"
brew "rtk"
